coq/aula4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<!-- 2018-05-05 sáb 14:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aula 4 - Prova por simplificação, reescrita e análise de caso</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rafael Castro - rafaelcgs10.github.io/coq" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Aula 4 - Prova por simplificação, reescrita e análise de caso</h1>

<div id="outline-container-orgde8d6e9" class="outline-2">
<h2 id="orgde8d6e9"><span class="section-number-2">1</span> Prova por Simplificação</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8ee1dc9" class="outline-3">
<h3 id="org8ee1dc9"><span class="section-number-3">1.1</span> Prova por Simplificação</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Já vimos alguns exemplos de simplificação utilizando a <i>tactic simpl</i> e <i>reflexivity</i>.</li>
<li>Os exemplos abaixo são um pouco diferente dos anteriores: há o quantificador para todo (<i>forall</i>).</li>
<li>A <i>tactic intros</i> remove do objetivo o quantificador e o termo de um tipo quantificado, e insere no contexto um termo arbitrário do mesmo tipo com um dado identificador.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">plus_O_n</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">n</span> : nat, 0 + n = n.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> n. <span style="color: #BFEBBF; background-color: #3F3F3F;">simpl</span>. <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.

<span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">plus_1_l</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">n</span>:nat, 1 + n = S n.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> n. <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.

<span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">mult_0_l</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">n</span>:nat, 0 * n = 0.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> n. <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org77ce6aa" class="outline-2">
<h2 id="org77ce6aa"><span class="section-number-2">2</span> Prova por Reescrita</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge62bb01" class="outline-3">
<h3 id="orge62bb01"><span class="section-number-3">2.1</span> Prova por Reescrita</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><i>intros</i> também move hipoteses de implicações para o contexto.</li>
<li><i>n</i> e <i>m</i> são números arbitrários. Não podemos simplismente usar simplificação e reflexividade.</li>
<li>Uma das hipoteses afirma que n é o mesmo número que m.</li>
<li>A tática <i>rewrite</i> com a seta <i>-&gt;</i> substitui as ocorrencias do termo do lado esquerdo pelo do lado direito. Com a seta <i>&lt;-</i> o contrário.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq">
<span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">plus_id_example</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">n m</span>:nat,
  n = m -&gt;
  n + n = m + m.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> n m.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> H.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">rewrite</span> -&gt; H.
  <span style="color: #BFEBBF;">reflexivity</span>.
<span style="color: #F0DFAF; font-weight: bold;">Qed</span>.

</pre>
</div>
</div>
</div>

<div id="outline-container-org832ceac" class="outline-3">
<h3 id="org832ceac"><span class="section-number-3">2.2</span> Exercícios de sala sobre reescrita</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Exercícios realizados em sala</b>
</p>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">mult_0_plus</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">n m</span> : nat,
  (0 + n) * m = n * m.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
<span style="background-color: #ff0000;">Admitted</span>.

<span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">mult_S_1</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">n m</span> : nat,
  m = S n -&gt;
  m * (1 + n) = m * m.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
<span style="background-color: #ff0000;">Admitted</span>.

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6b7f666" class="outline-2">
<h2 id="org6b7f666"><span class="section-number-2">3</span> Prova por Análise de Caso</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgfedd0eb" class="outline-3">
<h3 id="orgfedd0eb"><span class="section-number-3">3.1</span> Limites da Simplificação e Reescrita</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Simplificação e reescrita são muito poderosos, mas não são suficientes para o caso abaixo.</li>
<li>A definição de ambas as funções faz casamento de padrão no primeiro argumento, porém o primeiro argumento de ambos é um número desconhecido.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">plus_1_neq_0_firsttry</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">n</span> : nat,
  beq_nat (n + 1) 0 = false.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> n.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">simpl</span>.  <span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">does nothing! </span><span style="color: #5F7F5F;">*)</span>
<span style="color: #F0DFAF; font-weight: bold;">Abort</span>.

</pre>
</div>
</div>
</div>

<div id="outline-container-org619c859" class="outline-3">
<h3 id="org619c859"><span class="section-number-3">3.2</span> Prova por Análise de Caso - Parte 1</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Para prosseguir na prova é necessário considerar os possíveis valores de <i>n</i>:
<ol class="org-ol">
<li>Se <i>n = 0</i> então pode-se simplificar para <i>beq _nat 1 0 = false</i></li>
<li>Se <i>n = S n'</i> então pode-se simplificar para <i>beq _nat (S (n' + 1)) 0 = false</i>.</li>
</ol></li>
<li>A tática <i>destruct</i> faz exatamente isso, ao analisar os possíveis valores com base na definição de <i>nat</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-org9573c9d" class="outline-3">
<h3 id="org9573c9d"><span class="section-number-3">3.3</span> Prova por Análise de Caso - Parte 2</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><i>destruct</i> cria dois sub-objetivos novos.</li>
<li><i>as</i> possibilitar definir os nomes que serão dados aos termos da análise de caso.</li>
<li>O padrão é dado por uma lista de listas denotado por [ &#x2026; | &#x2026; | &#x2026; ]. Na definição de <i>nat</i>:
<ol class="org-ol">
<li>O primeiro termo somente pode ser <i>0</i>. Então usa-se uma lista vazia.</li>
<li>O segundo termo é um sucessor que tem um argumento que é um número natural. Nomea-se esse argumento de <i>n'</i>. Se houvesse mais um argumento para esse termo ele seria dado separado por um espaço: <i>[|n' m']</i>.</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org32c286f" class="outline-3">
<h3 id="org32c286f"><span class="section-number-3">3.4</span> Prova por Análise de Caso - Parte 3</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>O sinal <i>-</i>, conhecido como <i>bullet</i>, serve para focar ocultar os demais objetivos e focar no atual. O uso é opcional, serve apenas para organizar a prova.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">plus_1_neq_0</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">n</span> : nat,
  beq_nat (n + 1) 0 = false.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> n. <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> n <span style="color: #7CB8BB;">as</span> [| n'].
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF;">reflexivity</span>.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF;">reflexivity</span>.   <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd00c271" class="outline-3">
<h3 id="orgd00c271"><span class="section-number-3">3.5</span> <i>negb</i> é Involutivo</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Pode-se utilizar a tática <i>destruct</i> em qualquer tipo definido indutivamente, por exemplo o tipo <i>bool</i>.</li>
<li>Note que não há cláusula <i>as</i>, pois o tipo <i>bool</i> não tem argumentos. Poderia-se escrever <i>as []</i> ou <i>as [ | ]</i>.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">negb_involutive</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">b</span> : bool,
  negb (negb b) = b.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> b. <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> b.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF;">reflexivity</span>.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org4db67ff" class="outline-3">
<h3 id="org4db67ff"><span class="section-number-3">3.6</span> <i>andb</i> é Comutativo</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>De fato, é sempre possível omitir a cláusula <i>as</i>. Porém, se necessário o assistente escolherá os nomes para os termos.</li>
<li>O sinal <i>+</i> funciona como <i>-</i>, porém para um sub-objetivo de um <i>-</i>.</li>
<li>O sinal <i>*</i> é um terceiro <i>bullet</i>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">andb_commutative</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">b c</span>, andb b c = andb c b.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> b c. <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> b.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> c.
    <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">+</span> <span style="color: #BFEBBF;">reflexivity</span>.
    <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">+</span> <span style="color: #BFEBBF;">reflexivity</span>.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> c.
    <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">+</span> <span style="color: #BFEBBF;">reflexivity</span>.
    <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">+</span> <span style="color: #BFEBBF;">reflexivity</span>.
<span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org85de3f0" class="outline-3">
<h3 id="org85de3f0"><span class="section-number-3">3.7</span> <i>andb</i> Permuta</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>Também é possível cercar com chaves para focar numa nova prova.</li>
<li>Chaves são úteis quando há três niveis ou mais numa prova.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">andb3_exchange</span> :
  <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">b c d</span>, andb (andb b c) d = andb (andb b d) c.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> b c d. <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> b.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> c.
    { <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> d. - <span style="color: #BFEBBF;">reflexivity</span>. - <span style="color: #BFEBBF;">reflexivity</span>. }
    { <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> d. - <span style="color: #BFEBBF;">reflexivity</span>. - <span style="color: #BFEBBF;">reflexivity</span>. }
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> c.
    { <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> d. - <span style="color: #BFEBBF;">reflexivity</span>. - <span style="color: #BFEBBF;">reflexivity</span>. }
    { <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> d. - <span style="color: #BFEBBF;">reflexivity</span>. - <span style="color: #BFEBBF;">reflexivity</span>. }
<span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 07/05/2018</p>
<p class="author">Author: Rafael Castro - rafaelcgs10.github.io/coq</p>
<p class="date">Created: 2018-05-05 sáb 14:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
